<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Pagination Language Lines
    |--------------------------------------------------------------------------
    */

    'previous' => '&laquo; पिछला',
    'next'     => 'अगला &raquo;',
    's_length_menu' => 'प्रति पृष्ठ _MENU_ प्रविष्टियाँ प्रदर्शित करें',
    's_zero_records' => 'क्षमा करें, कुछ नहीं मिला',
    's_info' => '_TOTAL_ में से _START_ से _END_ तक दिखाया जा रहा है',
    's_info_empty' => '0 में से 0 से 0 प्रविष्टियाँ दिखाई जा रही हैं',
    's_infofiltered' => '(कुल _MAX_ प्रविष्टियों में से फ़िल्टर किया गया)',
    's_paginate' => [
        "first" => "पहला",
        "last" => "अंतिम",
        "next" => "अगला",
        "previous" => "पिछला",
    ],
];
