<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Password Reset Language Lines
    |--------------------------------------------------------------------------
    */

    'password' => 'पासवर्ड कम से कम आठ अक्षरों का होना चाहिए और पुष्टि से मेल खाना चाहिए।',
    'reset' => 'आपका पासवर्ड सफलतापूर्वक रीसेट कर दिया गया है!',
    'sent'  => 'हमने आपके पासवर्ड रीसेट लिंक को ईमेल कर दिया है!',
    'token' => 'यह पासवर्ड रीसेट टोकन अमान्य है।',
    'user'  => 'इस ईमेल पते के साथ कोई उपयोगकर्ता नहीं मिला।',

];
