<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Authentication Language Lines
    |--------------------------------------------------------------------------
    |
    | الأسطر التالية تُستخدم أثناء عملية تسجيل الدخول لعرض رسائل مختلفة للمستخدم.
    | يمكنك تعديل هذه النصوص بما يتناسب مع متطلبات تطبيقك.
    |
    */

    'failed'     => 'بيانات الاعتماد هذه غير متطابقة مع سجلاتنا.',
    'throttle'   => 'عدد محاولات تسجيل الدخول كبير جدًا. يرجى المحاولة مرة أخرى بعد :seconds ثانية.',
    'admin_area' => 'منطقة الإدارة PHP Newsletter',
];
