<?php

return [
    'str' => '
س: هل يمكن تخصيص الرسائل الإلكترونية؟</strong>
<p>ج: نعم، يمكنك ذلك. للقيام بهذا، أدخل %NAME% في قالب الرسالة. في المرة القادمة التي يتم فيها إرسال الرسائل، سيتم استبداله باسم المشترك في كل مرة.</p>

<strong>س: الرسائل إلى صناديق بريد خدمة gmail.com لا تصل، رغم أنها تُسلَّم إلى خدمات أخرى. ما السبب؟</strong>
<p>ج: على الأرجح أن عنوان خادم البريد الخاص بك قد تم إدراجه في القائمة السوداء لنظام gmail.com أو يتم تصفية الرسائل بواسطة مرشح الرسائل غير المرغوب فيها. تواصل مع مزود الاستضافة الخاص بك.</p>

<strong>س: تقول المجلة البريدية أنه تم إرسال 300 رسالة، ولكن تم استلام نصفها فقط. لماذا؟</strong>
<p>ج: حاول تحديد سبب عدم إرسال بعض الرسائل. يمكن الاطلاع على ذلك في تقرير عدم التسليم، والذي يصل عادة إلى عنوان البريد الإلكتروني المحدد في الإعدادات في حقل "البريد الإلكتروني".
يجب أن تتلقى أنت أو خادم الإرسال تقريرًا بعدم التسليم يحتوي على أسباب ذلك.</p>

<strong>س: لا يمكنني إرسال النشرة عبر خادم SMTP. يظهر الخطأ التالي في سجل الإرسال:
"The following From address failed: example@my-domain.com : Called Mail() without being connected"
ما السبب؟</strong>
<p>ج: قد تكون هناك عدة أسباب. ربما أدخلت عنوان خادم SMTP أو المنفذ بشكل غير صحيح في الإعدادات.
سبب آخر قد يكون أن الوصول إلى خادم SMTP محجوب بواسطة جدار حماية، أو أن الخادم غير متاح مؤقتًا.</p>

<strong>س: لا يتم عرض الصور في رسائل HTML.</strong>
<p>ج: معظم برامج البريد الإلكتروني، وكذلك خدمات البريد المجانية، تقوم افتراضيًا بحظر الصور المحملة من مصادر خارجية لأسباب أمنية.</p>

<strong>س: ما هو خادم SMTP؟</strong>
<p>ج: SMTP (بروتوكول نقل البريد البسيط) هو خادم على شبكة، سواء كانت عالمية أو محلية، يستقبل الرسائل الإلكترونية لإعادة توجيهها، كما يستقبل الرسائل من خوادم أخرى لمستخدميه المحليين.</p>

<strong>س: لا تأخذ المجلة البريدية في الاعتبار عدد الرسائل المقروءة. لماذا؟</strong>
<p>ج: تحقق من تنسيق الرسائل الصادرة في الإعدادات. هذه الميزة تعمل فقط عند اختيار تنسيق HTML للرسائل.</p>'
];
