<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Pagination Language Lines
    |--------------------------------------------------------------------------
    |
    | الأسطر التالية تُستخدم لإنشاء روابط التنقل بين الصفحات.
    | يمكنك تعديلها بما يتناسب مع واجهة تطبيقك.
    |
    */

    'previous' => '&laquo; السابق',
    'next'     => 'التالي &raquo;',
    's_length_menu' => 'عرض _MENU_ عنصر لكل صفحة',
    's_zero_records' => 'عذرًا، لم يتم العثور على أي نتائج',
    's_info' => 'عرض من _START_ إلى _END_ من أصل _TOTAL_ سجل',
    's_info_empty' => 'عرض 0 إلى 0 من أصل 0 سجل',
    's_infofiltered' => '(تمت التصفية من إجمالي _MAX_ سجل)',
    's_paginate' => [
        "first" => "الأول",
        "last" => "الأخير",
        "next" => "التالي",
        "previous" => "السابق",
    ],
];
