<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Password Reset Language Lines
    |--------------------------------------------------------------------------
    |
    | الأسطر التالية تُستخدم لعرض رسائل أخطاء أو نجاح عند محاولة إعادة تعيين كلمة المرور.
    |
    */

    'password' => 'يجب أن تكون كلمة المرور مكونة من ثمانية أحرف على الأقل وأن تتطابق مع تأكيدها.',
    'reset' => 'تمت إعادة تعيين كلمة المرور بنجاح!',
    'sent'  => 'تم إرسال رابط إعادة تعيين كلمة المرور إلى بريدك الإلكتروني!',
    'token' => 'رمز إعادة تعيين كلمة المرور غير صالح.',
    'user'  => 'لا يمكن العثور على مستخدم بهذا البريد الإلكتروني.',

];
