<?php

return [
    'str' => '
Q: क्या ईमेल को वैयक्तिकृत करना संभव है?</strong>
<p>A: हाँ, यह संभव है। इसके लिए ईमेल टेम्पलेट में %NAME% दर्ज करें। अगली बार जब ईमेल भेजे जाएंगे, तो इसे प्रत्येक बार सदस्य के नाम से बदल दिया जाएगा।</p>

<strong>Q: gmail.com सेवा के मेलबॉक्स में ईमेल नहीं पहुँचते, जबकि अन्य सेवाओं के मेलबॉक्स में पहुँच जाते हैं। इसका कारण क्या हो सकता है?</strong>
<p>A: संभवतः आपके मेल सर्वर का पता gmail.com प्रणाली द्वारा ब्लैकलिस्ट में डाल दिया गया है या ईमेल एंटी-स्पैम फ़िल्टर द्वारा फ़िल्टर किए जा रहे हैं। अपने होस्टिंग प्रदाता से संपर्क करें।</p>

Q: मेलिंग रिपोर्ट में दिखाया गया है कि 300 ईमेल भेजे गए, लेकिन उनमें से केवल आधे ही प्राप्त हुए। क्यों?</strong>
<p>A: यह जानने का प्रयास करें कि ईमेल क्यों नहीं पहुँचे। यह जानकारी नॉन-डिलीवरी रिपोर्ट में देखी जा सकती है, जो आमतौर पर सेटिंग्स में "E-mail" फ़ील्ड में निर्दिष्ट पते पर आती है।
आप या भेजने वाला सर्वर नॉन-डिलीवरी के कारणों के साथ एक रिपोर्ट प्राप्त करेगा।</p>

Q: मैं SMTP सर्वर के माध्यम से न्यूज़लेटर नहीं भेज पा रहा हूँ। मेलिंग लॉग में निम्न त्रुटि दिखाई देती है:
"The following From address failed: example@my-domain.com : Called Mail() without being connected"
इसका कारण क्या है?</strong>
<p>A: इसके कई कारण हो सकते हैं। संभव है कि आपने सेटिंग्स में SMTP सर्वर का पता या पोर्ट गलत दर्ज किया हो।
एक अन्य कारण यह हो सकता है कि फ़ायरवॉल द्वारा SMTP सर्वर तक पहुँच अवरुद्ध हो, या SMTP सर्वर अस्थायी रूप से उपलब्ध न हो।</p>

<strong>Q: HTML प्रारूप के ईमेल में चित्र प्रदर्शित नहीं हो रहे हैं।</strong>
<p>A: अधिकांश ईमेल क्लाइंट तथा मुफ्त ईमेल सेवाएँ सुरक्षा कारणों से डिफ़ॉल्ट रूप से बाहरी स्रोतों से लोड होने वाले चित्रों को ब्लॉक कर देती हैं।</p>

Q: SMTP सर्वर क्या होता है?</strong>
<p>A: SMTP (Simple Mail Transfer Protocol) एक सर्वर होता है जो किसी नेटवर्क (वैश्विक या स्थानीय) पर ईमेल को स्वीकार करता है और आगे प्रेषित करता है, तथा अन्य सर्वरों से ईमेल प्राप्त कर अपने स्थानीय उपयोगकर्ताओं तक पहुँचाता है।</p>

<strong>Q: न्यूज़लेटर लॉग पढ़े गए ईमेल की संख्या क्यों नहीं दिखाता?</strong>
<p>A: सेटिंग्स में आउटगोइंग ईमेल के प्रारूप की जाँच करें। यह सुविधा केवल तभी काम करती है जब HTML प्रारूप चुना गया हो।</p>'
];
