<?php

return [
    'agreement' => "Лицензионное соглашение на использование программных продуктов

УСЛОВИЯ ИЗГОТОВЛЕНИЯ КОПИЙ, РАСПРОСТРАНЕНИЯ И МОДИФИКАЦИИ:

Действие данного лицензионного соглашения распространяется на все
программные продукты или иные разработчик JANICKIY.COM, в которых
указано, что данная программа может распространяться только на условиях
данного лицензионного соглашения.

Термин \"Программный продукт\", употребляемый ниже, в применении к такой
программе (разработке) и термин \"разработка на основе Программного
продукта\" подразумевают либо сам Программный продукт, либо любую
произведенную на ее основе разработку, защищаемую законом об авторском
праве. Настоящее лицензионное соглашение адресовано Вам и заключается с Вами.
Данное лицензионное соглашение распространяется только на изготовление
копий, распространение и модификацию Программного продукта. Иные виды
действий над Программным продуктом выходят за рамки данного лицензионного
соглашения.

1. Разрешается делать копии и распространять точные копии исходных кодов
Программного продукта в том виде, в каком Вы их получили, на любом носителе
при условии, что каждую копию Вы снабжаете упоминаниями об авторском праве
и отказом от гарантий; сохраняете без изменений все, относящееся к данному
лицензионному соглашению и отсутствию каких-либо гарантий, и передаете всем
сторонним получателям Программного продукта копию данного лицензионного
соглашения вместе с Программным продуктом.

2. В свою копию Программного продукта и в любую его часть Вы можете
вносить изменения, создавая, таким образом, разработку на основе
Программного продукта, и делать копии и распространять эти модификации
или разработки на условиях, перечисленных выше, в разделе 1, в том случае,
если будут соблюдены также следующие условия:

2.1 Вы обязаны в точности указать, какие файлы были изменены, что именно
было изменено, и проставить дату внесения изменений.

2.2 Любые распространяемые или публикуемые вами разработки, которые
включают в себя целиком Программный продукт или какие-либо его части,
сделанные на основе Программного продукта или каких-либо его частей,
Вы должны в обязательном порядке лицензировать на условиях данного
лицензионного соглашения.

3. Если модифицируемая программа предназначена для интерактивной работы,
то при начале работы с целью подобного интерактивного использования
в обычном порядке обязательно должна быть показана или должно быть
сообщено о наличие и возможности просмотра уведомлений об авторском праве и
об отсутствии (или наличии обеспечиваемых вами) гарантий и о том, что
пользователи могут на условиях данного соглашения передавать программный
продукт другим пользователям, а также указания для пользователя, как
просмотреть копию данного лицензионного соглашения.
Эти требования распространяются на модифицированную разработку в целом.
Если логически выделенные составные части Вашей разработки не основаны на
этом Программный продукт и их можно полноправно считать независимыми
и самостоятельными разработками, данное лицензионное соглашение и ее
условия не распространяются на упомянутые разделы в тех случаях, когда вы
распространяете их как отдельные разработки.
Если же эти составные части распространяются как часть целостной разработки
на основе Программного продукта, вступает в силу данное лицензионное
соглашение, разрешающее лицензирование этой целостной разработки, и,
следовательно, применимое для всех и касающееся всякой ее части, вне
зависимости от того, кто является ее автором.

4. Делать копии, вносить изменения, сублицензировать или распространять
Программный продукт можно лишь на условиях, прямо оговоренных в данном
лицензионном соглашении. Любые иные попытки делать копии, изменять,
сублицензировать или распространять Программный продукт считаются
нарушением лицензионного соглашения и автоматически лишают вас прав,
предоставляемых данным соглашением.
Однако лицензии третьих лиц, уже получивших от Вас копии или какие-либо
права на условиях данного лицензионного соглашения, будут сохранять
юридическую силу до тех пор, пока эти лица полностью выполняют условия
соглашения.

5. Вы не обязаны принимать условия данного лицензионного соглашения,
поскольку вы не подписывали его. Однако ничто иное не дает вам позволения
изменять или распространять Программный продукт или созданные на его
основе разработки. В этом случае подобные действия запрещены действующим
законодательством, если вы не приняли условия данного соглашения.
Следовательно, внося какие-либо изменения или передавая кому-либо копию
Программного продукта (или любой разработки, созданной на его основе), вы
тем самым показываете, что приняли данное лицензионное соглашение, со
всеми его условиями и ограничениями относительно создания копий,
распространения или изменения Программного продукта или созданных на
его основе разработок.

6. Всякий раз, когда Вы передаете кому-либо копию Программного продукта
(или разработки, созданной на основе Программного продукта), новый
обладатель автоматически получает от исходного правообладателя разрешение
делать копии, распространять и вносить изменения в Программный продукт
в соответствии с условиями и ограничениями данного лицензионного соглашения.
Вы не можете вводить какие-либо дополнительные ограничения для прав нового
обладателя, предоставляемых ему данным лицензионным соглашением.
Вы не обязаны следить за соблюдением третьими лицами условий данного
соглашения.

7. Если вследствие судебного разбирательства, или объявления копии
контрафактной, или по какой-либо иной причине (не обязательно патентного
характера), вы (решением суда, взаимным соглашением или как-либо иначе)
поставлены в условия, противоречащие условиям данного лицензионного
соглашения, это не освобождает вас от обязанности соблюдать условия
данного лицензионного соглашения.
Если Вы не можете одновременно выполнять обязательства, налагаемые данным
лицензионным соглашением, и иные взятые на себя обязательства, то, как
следствие, Вы не должны распространять Программный продукт.
Например, если патентное соглашение не допускает безвозмездного дальнейшего
распространения Программного продукта теми, кто, прямо или косвенно,
получил его копию от вас, то единственный способ не нарушить ни его
условия, ни условия данного лицензионного соглашения это полностью
воздержаться от распространения Программного продукта.
Если какая-либо часть данного раздела признается не имеющей юридическую
силу или неприменимой в конкретных обстоятельствах, остальная
часть раздела остается в силе, а раздел в целом применим при иных
обстоятельствах.

8. Если распространение и\или использование Программного продукта в
конкретных странах ограничено патентными соглашениями или отношениями в
области авторских прав, исходный обладатель авторских прав, помещающий
свой Программный продукт под действие данного лицензионного соглашения,
может добавить четко сформулированные географические ограничения
распространения, исключив данные страны из числа тех, в которых позволено
распространение. В таком случае данное лицензионное соглашение должно
содержать эти ограничения, записанные непосредственно в собственно тексте
соглашения.

9. Если вы хотите включить части Программного продукта в иные свободно
распространяемые программные продукты, но распространяемые на иных условиях,
вы должны письменно спросите позволения у авторов.

ОТКАЗ ОТ ПРЕДОСТАВЛЕНИЯ ГАРАНТИЙ

10. ВВИДУ ТОГО, ЧТО ПРОГРАММНЫЙ ПРОДУКТ ЛИЦЕНЗИРУЕТСЯ БЕСПЛАТНО, НИКАКИЕ
ГАРАНТИИ НЕ ПРЕДОСТАВЛЯЮТСЯ В ТОЙ МЕРЕ, В КАКОЙ ЭТО ПОЗВОЛЯЕТСЯДЕЙСТВУЮЩИМ
ЗАКОНОДАТЕЛЬСТВОМ. ЗА ИСКЛЮЧЕНИЕМ СЛУЧАЕВ, КОГДА ИМЕЕТСЯ ПИСЬМЕННОЕ ЗАЯВЛЕНИЕ
ПРАВООБЛАДАТЕЛЕЙ ИЛИ РАСПРОСТРАНИТЕЛЕЙ ПРОГРАММНОГО ПРОДУКТА, ПРОГРАММНЫЙ
ПРОДУКТ ПРЕДОСТАВЛЯЕТСЯ ВАМ \"КАК ЕСТЬ\", ЧТО НЕ ПРЕДУСМАТРИВАЕТ КАКИХ-ЛИБО
ГАРАНТИЙ, В ТОМ ЧИСЛЕ ПОДРАЗУМЕВАЕМОЙ ГАРАНТИИ О ПРИГОДНОСТИ К КУПЛЕ-ПРОДАЖЕ,
А ТАКЖЕ ИСПОЛЬЗОВАНИЮ В ТЕХ ИЛИ ИНЫХ КОНКРЕТНЫХ ЦЕЛЯХ. ВЕСЬ РИСК, СВЯЗАННЫЙ С
ПРИЕМЛЕМОСТЬЮ ДЛЯ ВАС КАЧЕСТВА И ПРОИЗВОДИТЕЛЬНОСТИ ПРОГРАММНОГО ПРОДУКТА,
ВЫ ПРИНИМАЕТЕ НА СЕБЯ. В СЛУЧАЕ, ЕСЛИ ПРОГРАММНЫЙ ПРОДУКТ РАБОТАЕТ НЕКОРРЕКТНО,
ВЫ САМИ НЕСЕТЕ ВСЕ НЕОБХОДИМЫЕ РАСХОДЫ ПО ОБСЛУЖИВАНИЮ, УСТРАНЕНИЮ НЕПОЛАДОК
И ИСПРАВЛЕНИЮ.

11. НИ ПРИ КАКИХ ОБСТОЯТЕЛЬСТВАХ, ЗА ИСКЛЮЧЕНИЕМ СЛУЧАЕВ, КОГДА ТОГО ТРЕБУЕТ ЗАКОН,
ИЛИ ПО ПИСЬМЕННОМУ СОГЛАШЕНИЮ, НИКТО ИЗ ОБЛАДАТЕЛЕЙ АВТОРСКИХ ПРАВ ИЛИ ИНЫХ
ЛИЦ, ВНОСЯЩИХ ИЗМЕНЕНИЯ И\ИЛИ ЗАНИМАЮЩИХСЯ ДАЛЬНЕЙШИМ РАСПРОСТРАНЕНИЕМ
ПРОГРАММНОГО ПРОДУКТА НА ПРИВЕДЕННЫХ ВЫШЕ УСЛОВИЯХ, НЕ НЕСЕТ ОТВЕТСТВЕННОСТИ ЗА УБЫТКИ,
ВКЛЮЧАЯ ОБЩИЕ, СПЕЦИФИЧЕСКИЕ, СЛУЧАЙНЫЕ ИЛИ КОСВЕННЫЕ, ЯВЛЯЮЩИЕСЯ СЛЕДСТВИЕМ
ИСПОЛЬЗОВАНИЯ ИЛИ НЕВОЗМОЖНОСТИ ИСПОЛЬЗОВАНИЯ ПРОГРАММНОГО ПРОДУКТА (В ТОМ ЧИСЛЕ ПОТЕРЮ
ДАННЫХ, НЕУДОБНЫЙ ДЛЯ ВАС СПОСОБ ПОЛУЧЕНИЯ ДАННЫХ, ИЛИ ДОПОЛНИТЕЛЬНЫЕ РАСХОДЫ,
ПОНЕСЕННЫЕ ВАМИ ИЛИ ТРЕТЬИМИ ЛИЦАМИ, ИЛИ ОТКАЗ РАБОТАТЬ СОВМЕСТНО С КАКИМИ-
ЛИБО ИНЫМИ ПРОГРАММНЫМИ ПРОДУКТАМИ, ДАЖЕ ЕСЛИ ВЫШЕУПОМЯНУТЫЙ ПРАВООБЛАДАТЕЛЬ
ИЛИ ИНОЕ ЛИЦО БЫЛИ ПРЕДУПРЕЖДЕНЫ О ВОЗМОЖНОСТИ ПОДОБНЫХ УБЫТКОВ.
Распространяя данный программный продукт, мы надеемся, что он окажется
полезным, но НЕ ДАЕМ НИКАКИХ ГАРАНТИЙ, даже подразумеваемой гарантии
ПРИГОДНОСТИ К КУПЛЕ-ПРОДАЖЕ или ИСПОЛЬЗОВАНИЮ В КОНКРЕТНЫХ ЦЕЛЯХ Вместе с
данной программой вы должны получить нашу лицензию на программный продукт
",
];
